/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_nbrlen.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jobailla <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2016/11/12 12:53:16 by jobailla          #+#    #+#             */
/*   Updated: 2017/12/04 18:21:41 by jobailla         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
** Compte le nom de cararètre dans un int.
*/

#include "libft.h"

size_t	ft_nbrlen(intmax_t n)
{
	size_t	i;

	i = 1;
	while (n /= 10)
		i++;
	return (i);
}
